app/views/comments/_comment.html.erb

      <span class="name"><%= comment_author(comment.author, comment.url) %></span><br/>
      <span class="date">Posted <%= time_ago_in_words comment.created_at %> ago</span>
---
INSERT INTO "comments" ("updated_at", "created_at", "body", "url", "post_id", "email", "author") VALUES ('2011-04-01 00:28:45.075755', '2011-04-01 00:28:45.075755', '<img src="http://localhost:3000/images/logo_header.png?1290171486" onload="alert(''bla'');" />', '', 1, '', 'Daniel Lopes')