app/controllers/admin/assets_controller.rb

SELECT "assets".* FROM "assets" ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "assets"
---
  def index
    @assets = Asset.paginate(:page => params[:page])

SELECT "assets".* FROM "assets" WHERE "assets"."id" = 1 LIMIT 1
---
  def show
    @asset = Asset.find(params[:id])

INSERT INTO "assets" ("document_file_size", "title", "document_updated_at", "created_at", "description", "updated_at", "document_file_name", "document_content_type") VALUES (72951, 'Gauge', '2011-03-28 22:45:36.070592', '2011-03-28 22:45:36.300246', NULL, '2011-03-28 22:45:36.300246', 'gauges_sans_window.jpg', 'image/jpeg')
---
  def create
    @asset = Asset.new(params[:asset])
    flash[:notice] = 'Asset was successfully created.' if @asset.save

SELECT "assets".* FROM "assets" WHERE "assets"."id" = 1 LIMIT 1
DELETE FROM "assets" WHERE "assets"."id" = 1
---
  def destroy
    @asset = Asset.find(params[:id])
    @asset.destroy