app/controllers/admin/categories_controller.rb

  def create
    @category = Category.new(params[:category])
    flash[:notice] = 'Category was successfully created.' if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES ('2011-03-24 13:25:13.919423', 'Deploy', '2011-03-24 13:25:13.919423')

  def update
    @category = Category.find(params[:id])
    flash[:notice] = 'Category was successfully updated.' if @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
UPDATE "categories" SET "updated_at" = '2011-03-24 13:25:23.509966', "name" = 'Ruby 1.9' WHERE "categories"."id" = 1