app/controllers/admin/changes_controller.rb

  def index
    @changes = Change.all
---
SELECT "changes".* FROM "changes" ORDER BY released_on DESC

  def create
    @change = Change.new(params[:change])
    flash[:notice] = 'Change was successfully created.' if @change.save
---
INSERT INTO "changes" ("released_on", "created_at", "entry", "category", "updated_at") VALUES ('2011-04-06', '2011-04-06 23:23:02.347311', 'XYZ', 'feature', '2011-04-06 23:23:02.347311')