app/controllers/admin/comments_controller.rb

  def update
    @comment = @post.comments.find(params[:id])
    flash[:notice] = 'Comment was successfully updated.' if @comment.update_attributes(params[:comment])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 1 AND ("comments".post_id = 1) LIMIT 1
UPDATE "comments" SET "read" = 't', "updated_at" = '2011-04-06 23:20:07.646858' WHERE "comments"."id" = 1

  def load_post
    @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 ORDER BY created_at DESC LIMIT 1