app/controllers/admin/inquiries_controller.rb

SELECT "inquiries".* FROM "inquiries" WHERE "inquiries"."id" = 1 LIMIT 1
---
  def show
    @inquiry = Inquiry.find(params[:id])

SELECT "inquiries".* FROM "inquiries" WHERE "inquiries"."id" = 1 LIMIT 1
UPDATE "inquiries" SET "updated_at" = '2011-03-30 22:38:42.480911', "open" = 'f' WHERE "inquiries"."id" = 1
---
  def update
    @inquiry = Inquiry.find(params[:id])
    flash[:notice] = 'Category was successfully updated.' if @inquiry.update_attributes(params[:inquiry])

SELECT "inquiries".* FROM "inquiries" WHERE "inquiries"."id" = 1 LIMIT 1
DELETE FROM "inquiries" WHERE "inquiries"."id" = 1
---
  def destroy
    @inquiry = Inquiry.find(params[:id])
    @inquiry.destroy