app/controllers/admin/posts_controller.rb

  def index
    @posts = Post.paginate(:page => params[:page])
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 30 OFFSET 0

  def create
    @post = Post.new(params[:post])

    flash[:notice] = 'Post was successfully created.' if @post.save
---
INSERT INTO "posts" ("draft", "published_at", "body", "created_at", "slug", "author_id", "excerpt", "updated_at", "title") VALUES ('f', '2011-03-31 03:00:00.000000', 'asdfsd', '2011-04-01 00:48:46.422745', 'asdfasdf', 1, 'asdf', '2011-04-01 00:48:46.422745', 'asdfasdf')

  def update
    @post = Post.find(params[:id])
    flash[:notice] = 'Post was successfully updated.' if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 5 ORDER BY created_at DESC LIMIT 1
UPDATE "posts" SET "published_at" = '2011-03-25 03:00:00.000000', "excerpt" = '', "updated_at" = '2011-03-28 23:01:05.339793', "body" = 'bla !/system/documents/2/original/gauges_sans_window.jpg?1301352336!', "author_id" = 3 WHERE "posts"."id" = 5

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 ORDER BY created_at DESC LIMIT 1
DELETE FROM "posts" WHERE "posts"."id" = 1

  def assets
    @assets = Asset.paginate(:page => params[:page], :per_page => 4)
---
SELECT "assets".* FROM "assets" ORDER BY created_at DESC LIMIT 4 OFFSET 4
SELECT COUNT(*) FROM "assets"

  def load_resources
    @authors = User.all
    @categories = Category.all
    @assets = Asset.paginate(:page => params[:page], :per_page => 4)
---
SELECT "users".* FROM "users"
SELECT "categories".* FROM "categories"
SELECT "assets".* FROM "assets" ORDER BY created_at DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "assets"