app/controllers/admin/users_controller.rb

  def create
    @user = User.new(params[:user])
    flash[:notice] = 'User was successfully created.' if @user.save
---
INSERT INTO "users" ("current_sign_in_ip", "created_at", "email", "full_name", "last_sign_in_ip", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "updated_at", "encrypted_password", "reset_password_token") VALUES (NULL, '2011-04-01 00:14:22.935946', 'daniel@objetiva.co', 'Daniel Lopes', NULL, NULL, 0, NULL, NULL, '2011-04-01 00:14:22.935946', '$2a$10$iJobUrSuF3REhds9k/.Q2ubJhQsTdpgd7qSbHrzF0ZKnhkHX7MBmG', NULL)

  def update
    @user = User.find(params[:id])
    flash[:notice] = 'User was successfully updated.' if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "encrypted_password" = '$2a$10$11RFIIVOU2DmZcf3j0jpWOxGY8lqaQ6D6YpJsXR.2ClGz3I1TBFCO', "updated_at" = '2011-04-01 00:18:01.232108', "email" = 'zemane@gmail.com' WHERE "users"."id" = 2