app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    flash[:alert] = 'Fail to receive the comment. Double check the fields' unless @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 ORDER BY created_at DESC LIMIT 1
INSERT INTO "comments" ("url", "updated_at", "author", "email", "body", "post_id", "created_at") VALUES ('http://www.egenial.com.br/', '2011-03-21 23:48:04.110807', 'Daniel Lopes', 'danielvlopes@gmail.com', 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. ', 3, '2011-03-21 23:48:04.110807')