app/controllers/inquiries_controller.rb

INSERT INTO "inquiries" ("subject", "email", "message", "open", "created_at", "name", "updated_at") VALUES ('billing', 'danielvlopes@gmail.com', 'Hello, I want a new feature', 't', '2011-03-31 21:22:34.913323', 'Daniel Lopes', '2011-03-31 21:22:34.913323')
---
  def create
    @inquiry = Inquiry.new(params[:inquiry])

    if @inquiry.save