app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title LIKE '%rails%' OR body LIKE '%rails%') AND (draft = 'f' AND published_at < '2011-03-24 00:25:09.469750')
SELECT "posts".* FROM "posts" INNER JOIN "categories_posts" ON "posts".id = "categories_posts".post_id WHERE ("categories_posts".category_id = 1 ) AND (draft = 'f' AND published_at < '2011-03-24 00:25:12.131453')
SELECT "posts".* FROM "posts" INNER JOIN "categories_posts" ON "posts".id = "categories_posts".post_id WHERE ("categories_posts".category_id = 3 ) AND (draft = 'f' AND published_at < '2011-04-06 23:14:15.638384') ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts" INNER JOIN "categories_posts" ON "posts".id = "categories_posts".post_id WHERE ("categories_posts".category_id = 1 ) AND (draft = 'f' AND published_at < '2011-03-24 00:25:12.131453')
---
  def index
    @posts = Post.scoped
    @posts = @posts.search(params[:search]) if params[:search]
    @posts = @category.posts if @category.present?
    @posts = @posts.published
    @posts = @posts.paginate(:page => params[:page])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 AND (draft = 'f' AND published_at < '2011-03-30 23:16:31.157636') ORDER BY created_at DESC LIMIT 1
---
  def show
    @post = Post.published.find(params[:id])

SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (1, 2, 3)
---
  def load_categories
    @categories = Category.all
    @category = Category.find(params[:category_id]) if params[:category_id]